//Условное ветвление: if, '?'

// Используя конструкцию if..else, напишите код, который будет спрашивать: „Какое «официальное» название JavaScript?“

// Если пользователь вводит «ECMAScript», то показать: «Верно!», в противном случае – отобразить: «Не знаете? ECMAScript!»

// let nameProgramm = prompt("Какое «официальное» название JavaScript?");

// if (nameProgramm == "ECMAScript") {
//   alert("Верно!");
// } else {
//   alert("Не знаете? ECMAScript!");
// }

// Используя конструкцию if..else, напишите код, который получает число через prompt, а затем выводит в alert:

// let a = +prompt("Введите число");

// if (a > 0) {
//   alert(`Значение ${a} больше нуля`);
// } else if (a < 1) {
//   alert(`Значение ${a} меньше нуля`);
// } else if (a == 0) {
//   alert("Значение равно нулю");
// } else {
//   alert("Вы вводите строку");
// }
