// Переменные

// Переменная – это «именованное хранилище» для данных. Мы можем использовать переменные для хранения товаров, посетителей и других данных.

// let user = "Anton",
//   age = 32,
//   message = "Учу Js";

// let text;

// text = "Hello!";

// text = "World!"; // значение изменено

// alert(text);

// Примеры допустимых имён:

// let userName;
// let test123;

// let $ = 1; // объявили переменную с именем "$"
// let _ = 2; // а теперь переменную с именем "_"

// alert($ + _); // 3

//Примеры неправильных имён переменных:

// let 1a; // не может начинаться с цифры

// let my-name; // дефис '-' не разрешён в имени

// Переменные с именами apple и APPLE – это две разные переменные.

// Константы

// const myBirthday = "08.11.1990";

// const COLOR_RED = "#F00";
// const COLOR_GREEN = "#0F0";
// const COLOR_BLUE = "#00F";
// const COLOR_ORANGE = "#FF7F00";

// Задачи

// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

// let admin;
// let name = "Джон";
// admin = name;
// alert(admin);

// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

// let MyDarlingEarth
// let CurrentUser
