// Базовые операторы, математика

// Сложение +,
// Вычитание -,
// Умножение *,
// Деление /,
// Взятие остатка от деления %,
// Возведение в степень **.

//Чему будут равны переменные a, b, c и d в примере ниже?

// let a = 1, b = 1;

// let c = ++a; // ? 2
// let d = b++; // ? 1

// Чему будут равны переменные a и x после исполнения кода в примере ниже?

// let a = 2;

// let x = 1 + (a *= 2); // a = 4, x = 5

// Какой результат будет у выражений ниже?

// "" + 1 + 0; //"10"
// "" - 1 + 0; // -1
// true + false; // 1
// 6 / "3"; //2
// "2" * "3"; //6
// 4 + 5 + "px"; //"9px"
// "$" + 4 + 5; "$45"
// "4" - 2; // 2
// "4px" - 2;// nan
// "  -9  " + 5;// "-95"
// "  -9  " - 5;// -14
// null + 1; // 1
// undefined + 1;  NaN
// " \t \n" - 2; -2

// let a = prompt("Первое число?", 1);
// a = Number(a);
// let b = prompt("Второе число?", 2);
// b = Number(b);
// alert(a + b);
