//Операторы сравнения

    // Больше/меньше: a > b, a < b.
    // Больше/меньше или равно: a >= b, a <= b.
    // Равно: a == b. Обратите внимание, для сравнения используется двойной знак равенства ==. Один знак равенства a = b означал бы присваивание.
    // Не равно. В математике обозначается символом ≠, но в JavaScript записывается как a != b.


//Каким будет результат этих выражений?

// 5 > 4; 1
// "ананас" > "яблоко"; 0
// "2" > "12"; 1
// undefined == null; 1
// undefined === null; 0
// null == "\n0\n"; 0
// null === +"\n0\n"; 0