// В JavaScript любые текстовые данные являются строками. Не существует отдельного типа «символ», который есть в ряде других языков.

// Внутренний формат для строк — всегда UTF-16, вне зависимости от кодировки страницы.


// Символ 	Описание
// \n 	Перевод строки
// \r 	В текстовых файлах Windows для перевода строки используется комбинация символов \r\n, а на других ОС это просто \n. Это так по историческим причинам, ПО под Windows обычно понимает и просто \n.
// \', \", \` 	Кавычки
// \\ 	Обратный слеш
// \t 	Знак табуляции
// \b, \f, \v 	Backspace, Form Feed и Vertical Tab — оставлены для обратной совместимости, сейчас не используются.