// 1
// Возведите 2 в 10 степень.

// let num = 2 ** 10;

// console.log(num);

// 2
// Найдите квадратный корень из 245.

// let numb = 245;

// console.log(Math.sqrt(numb));

// 3
// Дан следующий массив:
// [4, 2, 5, 19, 13, 0, 10]
// Найдите квадратный корень из суммы кубов его элементов. Для решения воспользуйтесь циклом for.

// let array = [4, 2, 5, 19, 13, 0, 10];

// let getSumCubes = (arr) => {
//   let sum = 0;
//   for (let i of arr) {
//     sum += i ** 3;
//   }
//   return sum;
// };

// console.log(getSumCubes(array));

// 4
// Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до сотых.

// let num = Math.sqrt(379);

